app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("table_id", "user_id", "open_reservation_time", "close_reservation_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    reservation = Reservation.create(reservation_params)